code-review/NRB_3471_3546/База_Стало/Reports/ЖурналОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЖурналОпераций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДокументОснование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБДепозитарийМХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБДепозитарийМХ</Name>
			<Comment>Остатки ЦБ по дате исполнения в депозитарии МХ</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/Входящий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Входящий</Name>
			<Comment>Строка журнала входящих документов</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий200</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицоНаправившееДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокументаИлиКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийПакетИзФайловогоШлюза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ОткрытиеСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОткрытиеСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДепозитарногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДепозитарногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ЗакрытиеРазделаСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗакрытиеРазделаСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРазделаСчетаДепо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРазделаСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРазделСчетаДепо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСубклиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ЗакрытиеСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗакрытиеСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ЖурналОпераций/Ext/ObjectModule.bsl
// Процедура выполняет замену ключей текста запроса на корректный текст компиляции
Процедура ВыполнитьОбработкуИЗаменуТекстаЗапроса(Запрос)
	ТекстЗапроса     = Запрос.Текст;
	ПараметрыЗапроса = Запрос.Параметры;
	
	Если УстановленОтборПо("Депонент", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ДепонентВидСравнения,
			"&Депонент", "ЖурналОпераций.СчетДЕПО.Владелец", , , ПараметрыЗапроса.Депонент); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДепоненту", СтрокаОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДепоненту", "Истина");
	КонецЕсли;
	
	Если УстановленОтборПо("СчетДЕПО", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.СчетДЕПОВидСравнения,
			"&СчетДЕПО", "ЖурналОпераций.СчетДепо", , , ПараметрыЗапроса.СчетДЕПО); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоСчетуДЕПО", СтрокаОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоСчетуДЕПО", "Истина");
	КонецЕсли;
	
	Если УстановленОтборПо("ЦеннаяБумага", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ЦеннаяБумагаВидСравнения,
			"&ЦеннаяБумага", "ЖурналОпераций.ЦеннаяБумага", , , ПараметрыЗапроса.ЦеннаяБумага); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоЦеннойБумаге", СтрокаОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоЦеннойБумаге", "Истина");
	КонецЕсли;
	
	Если УстановленОтборПо("ВидОперации", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ВидОперацииВидСравнения,
			"&ВидОперации", "ЖурналОпераций.ВидОперации", , , ПараметрыЗапроса.ВидОперации); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоВидуОперации", СтрокаОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоВидуОперации", "Истина");
	КонецЕсли;
	
	Если УстановленОтборПо("Инициатор", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ИнициаторВидСравнения,
			"&Инициатор", "ЖурналОпераций.Инициатор",  , , ПараметрыЗапроса.Инициатор); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоИнициатору", СтрокаОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоИнициатору", "Истина");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
КонецПроцедуры

Процедура ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос)
	сзПараметрыЗапроса = Новый СписокЗначений;
	сзПараметрыЗапроса.Добавить("Депонент");
	сзПараметрыЗапроса.Добавить("СчетДЕПО");
	сзПараметрыЗапроса.Добавить("ЦеннаяБумага");
	сзПараметрыЗапроса.Добавить("ВидОперации");
	сзПараметрыЗапроса.Добавить("Инициатор");
	
	Для Каждого элПарам Из сзПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(элПарам.Значение,						Неопределено);
		Запрос.УстановитьПараметр(элПарам.Значение + "ВидСравнения",	Неопределено);
		Запрос.УстановитьПараметр(элПарам.Значение + "Использование",	Ложь);
	КонецЦикла;

	// Заполним структуру параметров на основании данных отбора
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
	Для Каждого Эл Из ЭлементыОтбора Цикл
		Если Эл.Использование Тогда
			
			ИмяПараметра1 = СокрЛП(эл.ЛевоеЗначение);
			ИмяПараметра2 = СокрЛП(эл.ЛевоеЗначение) + "ВидСравнения";
			ИмяПараметра3 = СокрЛП(эл.ЛевоеЗначение) + "Использование";
			
			Если Запрос.Параметры.Свойство(ИмяПараметра1) Тогда
				Запрос.Параметры[ИмяПараметра1] = эл.ПравоеЗначение;
			КонецЕсли;
			
			Если Запрос.Параметры.Свойство(ИмяПараметра2) Тогда
				Запрос.Параметры[ИмяПараметра2] = эл.ВидСравнения;
				
			КонецЕсли;
			
			Если Запрос.Параметры.Свойство(ИмяПараметра3) Тогда
				Запрос.Параметры[ИмяПараметра3] = эл.Использование;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Возвращает результат запроса к БД
Функция СформироватьЗапрос() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",					НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаОкончания",				КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("КлассОперацийГлобальные",	Перечисления.КлассыОпераций.Глобальные);
	Запрос.УстановитьПараметр("ОперацияИзмененияДанныхЦБ",	Справочники.ВидыОпераций.ИзменениеДанныхЦБ);
	ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналОпераций.Операция КАК Операция,
	|	ЖурналОпераций.НомерОперации КАК НомерОперации,
	|	ЖурналОпераций.Период КАК ДатаОперации,
	|	ВЫБОР
	|		КОГДА ЖурналОпераций.ВидОперации ССЫЛКА Справочник.ВидыОпераций
	|			ТОГДА ЖурналОпераций.ВидОперации
	|		КОГДА ЖурналОпераций.ВидОперации ССЫЛКА Перечисление.ВидыОтчетов
	|			ТОГДА ""Формирование отчета/выписки""
	|	КОНЕЦ КАК ВидОперации,
	|	ЖурналОпераций.СчетДЕПО КАК СчетДЕПО,
	|	ЖурналОпераций.РазделСчетаДЕПО КАК РазделСчетаДЕПО,
	|	ЖурналОпераций.РазделСчетаДЕПО.Код КАК РазделСчетаДЕПОКод,
	|	ВложенныйЗапрос.СчетДепоМХ КАК СчетДепоМХ,
	|	ВложенныйЗапрос.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ЖурналОпераций.Поручение.КодОтчетаНРД КАК ОтчетНРД,
	|	ТИПЗНАЧЕНИЯ(ЖурналОпераций.Поручение.Депонент) КАК Депонент,
	|	ЖурналОпераций.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЖурналОпераций.ЦеннаяБумага.Наименование КАК ПолноеНаименованиеЦБ,
	|	ВЫБОР
	|		КОГДА ЖурналОпераций.ЦеннаяБумага.НомерРегистрации <> """"
	|			ТОГДА ЖурналОпераций.ЦеннаяБумага.НомерРегистрации
	|		ИНАЧЕ ЖурналОпераций.ЦеннаяБумага.ISIN
	|	КОНЕЦ КАК НомерРегистрацииISIN,
	|	ЖурналОпераций.Поручение КАК Поручение,
	|	ВЫБОР
	|		КОГДА ЖурналОпераций.Поручение ССЫЛКА Документ.Поручение
	|			ТОГДА ""Поручение""
	|		КОГДА ЖурналОпераций.Поручение ССЫЛКА Документ.иц_СводноеПоручение
	|			ТОГДА ""Сводное поручение""
	|		КОГДА ЖурналОпераций.ВидОперации = &ОперацияИзмененияДанныхЦБ
	|			ТОГДА ВЫРАЗИТЬ(ЖурналОпераций.Операция КАК Документ.Входящий).ИсходящийНомер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НаименованиеДокументаОснования,
	|	ВЫБОР
	|		КОГДА ЖурналОпераций.ВидОперации = &ОперацияИзмененияДанныхЦБ
	|			ТОГДА ЖурналОпераций.НомерОперации
	|		ИНАЧЕ ЖурналОпераций.Поручение.Номер
	|	КОНЕЦ КАК НомерДокументаОснования,
	|	ЖурналОпераций.Поручение.Дата КАК ДатаДокументаОснования,
	|	ЖурналОпераций.Поручение.Инициатор КАК Инициатор,
	|	ЖурналОпераций.Исполнитель КАК Исполнитель,
	|	ЖурналОпераций.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА ЖурналОпераций.ВидОперации.КлассОпераций = &КлассОперацийГлобальные
	|				И ЖурналОпераций.ВидОперации.ВыплатаДоходаВДенежнойФорме
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоИзвещениеОВыплате,
	|	ВЫБОР
	|		КОГДА ЖурналОпераций.Операция ССЫЛКА Документ.ОткрытиеСчетаДепо
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЖурналОпераций.Операция КАК Документ.ОткрытиеСчетаДепо).СчетДепо.НомерДепозитарногоДоговора, """")
	|		КОГДА ЖурналОпераций.Операция ССЫЛКА Документ.ОткрытиеРазделаСчетаДепо
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЖурналОпераций.Операция КАК Документ.ОткрытиеРазделаСчетаДепо).СчетДепо.НомерДепозитарногоДоговора, """")
	|		КОГДА ЖурналОпераций.Операция ССЫЛКА Документ.НазначениеПредставителяСчетаДепо
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЖурналОпераций.Операция КАК Документ.НазначениеПредставителяСчетаДепо).СчетДепо.НомерДепозитарногоДоговора, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДепозитарногоДоговора,
	|	ВЫБОР
	|		КОГДА ЖурналОпераций.Операция ССЫЛКА Документ.ОткрытиеСчетаДепо
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЖурналОпераций.Операция КАК Документ.ОткрытиеСчетаДепо).СчетДепо.ДатаЗаключенияДепозитарногоДоговора, ДАТАВРЕМЯ(1, 1, 1))
	|		КОГДА ЖурналОпераций.Операция ССЫЛКА Документ.ОткрытиеРазделаСчетаДепо
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЖурналОпераций.Операция КАК Документ.ОткрытиеРазделаСчетаДепо).СчетДепо.ДатаЗаключенияДепозитарногоДоговора, ДАТАВРЕМЯ(1, 1, 1))
	|		КОГДА ЖурналОпераций.Операция ССЫЛКА Документ.НазначениеПредставителяСчетаДепо
	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ЖурналОпераций.Операция КАК Документ.НазначениеПредставителяСчетаДепо).СчетДепо.ДатаЗаключенияДепозитарногоДоговора, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаДепозитарногоДоговора
	|ИЗ
	|	РегистрСведений.ЖурналОпераций КАК ЖурналОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиЦБДепозитарийМХ.Регистратор КАК Регистратор,
	|			ОстаткиЦБДепозитарийМХ.РазделСчетаДепо КАК РазделСчетаДепо,
	|			МАКСИМУМ(ОстаткиЦБДепозитарийМХ.СчетДепоМХ) КАК СчетДепоМХ,
	|			МАКСИМУМ(ОстаткиЦБДепозитарийМХ.РазделСчетаДепоМХ) КАК РазделСчетаДепоМХ
	|		ИЗ
	|			РегистрНакопления.ОстаткиЦБДепозитарийМХ КАК ОстаткиЦБДепозитарийМХ
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиЦБДепозитарийМХ.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ОстаткиЦБДепозитарийМХОбороты
	|				ПО ОстаткиЦБДепозитарийМХ.Регистратор = ОстаткиЦБДепозитарийМХОбороты.Регистратор
	|					И ОстаткиЦБДепозитарийМХ.РазделСчетаДепоМХ = ОстаткиЦБДепозитарийМХОбороты.РазделСчетаДепоМХ
	|		ГДЕ
	|			ОстаткиЦБДепозитарийМХ.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			И ОстаткиЦБДепозитарийМХОбороты.КоличествоОборот <> 0
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиЦБДепозитарийМХ.Регистратор,
	|			ОстаткиЦБДепозитарийМХ.РазделСчетаДепо
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ОткрытиеРазделаСчетаДепо.Ссылка,
	|			NULL,
	|			ЕСТЬNULL(СчетаДепоМХ.Ссылка, Поручение.СчетДепоМХ),
	|			ЕСТЬNULL(ОткрытиеРазделаСчетаДепо.РазделСчетаДепоМХ.Код, ОткрытиеРазделаСчетаДепо.РазделСчетаДепо.Код)
	|		ИЗ
	|			Документ.ОткрытиеРазделаСчетаДепо КАК ОткрытиеРазделаСчетаДепо
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|					ПО Поручение.СчетДепо = СчетаДепоМХ.Ссылка
	|				ПО ОткрытиеРазделаСчетаДепо.ДокументОснование = Поручение.Ссылка
	|		ГДЕ
	|			ОткрытиеРазделаСчетаДепо.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			И (Поручение.ОткрытьВМХ
	|						И Поручение.КодОтчетаНРД <> """"
	|					ИЛИ НЕ ОткрытиеРазделаСчетаДепо.ВладелецСчета ССЫЛКА Справочник.Контрагенты)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЗакрытиеРазделаСчетаДепо.Ссылка,
	|			NULL,
	|			ЕСТЬNULL(СчетаДепоМХ.Ссылка, Поручение.СчетДепоМХ),
	|			ЕСТЬNULL(Поручение.РазделСчетаДепоМХ.Код, Поручение.РазделСчетаДепоМХ)
	|		ИЗ
	|			Документ.ЗакрытиеРазделаСчетаДепо КАК ЗакрытиеРазделаСчетаДепо
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепоМХ КАК СчетаДепоМХ
	|					ПО Поручение.СчетДепо = СчетаДепоМХ.Ссылка
	|				ПО ЗакрытиеРазделаСчетаДепо.ДокументОснование = Поручение.Ссылка
	|		ГДЕ
	|			ЗакрытиеРазделаСчетаДепо.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			И (Поручение.ЗакрытьВМХ
	|						И Поручение.КодОтчетаНРД <> """"
	|					ИЛИ НЕ ЗакрытиеРазделаСчетаДепо.ВладелецСчета ССЫЛКА Справочник.Контрагенты)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ОткрытиеСчетаДепо.Ссылка,
	|			NULL,
	|			ОткрытиеСчетаДепо.СчетДепо,
	|			NULL
	|		ИЗ
	|			Документ.ОткрытиеСчетаДепо КАК ОткрытиеСчетаДепо
	|		ГДЕ
	|			ОткрытиеСчетаДепо.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			И НЕ ОткрытиеСчетаДепо.ВладелецСчета ССЫЛКА Справочник.Контрагенты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЗакрытиеСчетаДепо.Ссылка,
	|			NULL,
	|			ЗакрытиеСчетаДепо.СчетДепо,
	|			NULL
	|		ИЗ
	|			Документ.ЗакрытиеСчетаДепо КАК ЗакрытиеСчетаДепо
	|		ГДЕ
	|			ЗакрытиеСчетаДепо.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|			И НЕ ЗакрытиеСчетаДепо.ВладелецСчета ССЫЛКА Справочник.Контрагенты
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЖурналОпераций.Операция,
	|			МАКСИМУМ(ЖурналОпераций.РазделСчетаДЕПО),
	|			МАКСИМУМ(ПоручениеЦенныеБумагиСписываемые.СчетДепоМХ),
	|			МАКСИМУМ(ПоручениеЦенныеБумагиСписываемые.РазделСчетаДепоМХ)
	|		ИЗ
	|			РегистрСведений.ЖурналОпераций КАК ЖурналОпераций
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Поручение.ЦенныеБумагиСписываемые КАК ПоручениеЦенныеБумагиСписываемые
	|				ПО ЖурналОпераций.Операция.ДокументОснование = ПоручениеЦенныеБумагиСписываемые.Ссылка
	|					И ЖурналОпераций.Операция.СчетДепо = ПоручениеЦенныеБумагиСписываемые.СчетДепо
	|					И (ЖурналОпераций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|					И (ПоручениеЦенныеБумагиСписываемые.Ссылка.ВидОперацииД.КлассОпераций = &КлассОперацийГлобальные)
	|					И (ПоручениеЦенныеБумагиСписываемые.Ссылка.ВидОперацииД.ВыплатаДоходаВДенежнойФорме)
	|					И (НЕ ПоручениеЦенныеБумагиСписываемые.Ссылка.ВидОперацииД.ДвижениеПоЦБ)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЖурналОпераций.Операция) КАК ВложенныйЗапрос
	|		ПО ЖурналОпераций.Операция = ВложенныйЗапрос.Регистратор
	|			И (ЖурналОпераций.РазделСчетаДЕПО = ЕСТЬNULL(ВложенныйЗапрос.РазделСчетаДепо, ЖурналОпераций.РазделСчетаДЕПО))
	|ГДЕ
	|	ЖурналОпераций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И &ОтборПоДепоненту
	|	И &ОтборПоСчетуДЕПО
	|	И &ОтборПоЦеннойБумаге
	|	И &ОтборПоВидуОперации
	|	И &ОтборПоИнициатору
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЖурналОпераций.Период,
	|	ЖурналОпераций.Операция,
	|	ЖурналОпераций.НомерОперации";
	ВыполнитьОбработкуИЗаменуТекстаЗапроса(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
КонецФункции

// Возвращает структуру параметров шапки макета
Функция СформироватьПараметрыШапкиМакета() Экспорт
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДтНач", Формат(ДатаНач, "ДФ=dd.MM.yyyy"));
	СтруктураВозврата.Вставить("ДтКон", Формат(ДатаКон, "ДФ=dd.MM.yyyy"));
	Возврат СтруктураВозврата;
КонецФункции

// Очищает значения параметров области макета
Процедура ОчиститьЗначенияПараметровМакета(ПараметрыМакета) Экспорт
	Для Инд = 0 По (ПараметрыМакета.Количество() - 1) Цикл
		ПараметрыМакета.Установить(Инд, Неопределено);
	КонецЦикла;
КонецПроцедуры	

Процедура СформироватьОтчет(Таблица) Экспорт
	
	ОперацииОткрытия = Новый Массив;
	ОперацииОткрытия.Добавить(Справочники.ВидыОпераций.ОткрытиеСчетаДепо);
	ОперацииОткрытия.Добавить(Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо);
	
	ОперацииНазначения = Новый Массив;
	ОперацииНазначения.Добавить(Справочники.ВидыОпераций.НазначениеОператораСчетаДепо);
	
	РезультатЗапроса = СформироватьЗапрос();
	Если РезультатЗапроса.Пустой() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Данные для формирования отчета не обнаружены!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаОснование	= Макет.ПолучитьОбласть("Шапка|Основание");
	ОбластьШапкаОтчет		= Макет.ПолучитьОбласть("Шапка|Отчет");
	ОбластьСтрокаОснование	= Макет.ПолучитьОбласть("Строка|Основание");
	ОбластьСтрокаОтчет		= Макет.ПолучитьОбласть("Строка|Отчет");
	ОбластьПодвалОснование	= Макет.ПолучитьОбласть("Подвал|Основание");
	ОбластьПодвалОтчет		= Макет.ПолучитьОбласть("Подвал|Отчет");

	// ЗАГОЛОВОК
	СтруктураЗаголовка = СформироватьПараметрыШапкиМакета();
	ОбластьЗаголовок.Параметры.Заполнить(СтруктураЗаголовка);
	Таблица.Вывести(ОбластьЗаголовок);
	
	// ШАПКА
	Если ПоказыватьДокументОснование Тогда
		Таблица.Вывести(ОбластьШапкаОснование);
		Таблица.Присоединить(ОбластьШапкаОтчет);
	Иначе
		Таблица.Вывести(ОбластьШапкаОтчет);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		// СТРОКА ОТЧЕТА
		
		// Заполнение параметров строки
		ОчиститьЗначенияПараметровМакета(ОбластьСтрокаОтчет.Параметры);
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаОтчет.Параметры, Выборка);
		
		Если ОперацииОткрытия.Найти(Выборка.ВидОперации) <> Неопределено Тогда
			ОбластьСтрокаОтчет.Параметры.НаименованиеДокументаОснования = Выборка.НаименованиеДокументаОснования
				+ "/Депозитарный договор №"	+ СокрЛП(Выборка.НомерДепозитарногоДоговора)
				+ " от " + Формат(Выборка.ДатаДепозитарногоДоговора, "ДЛФ=Д");
				
		ИначеЕсли ОперацииНазначения.Найти(Выборка.ВидОперации) <> Неопределено Тогда
			ОбластьСтрокаОтчет.Параметры.НаименованиеДокументаОснования = Выборка.НаименованиеДокументаОснования
				+ "/Договор обслуживания на финансовых рынках №" + СокрЛП(Выборка.НомерДепозитарногоДоговора)
				+ " от " + Формат(Выборка.ДатаДепозитарногоДоговора, "ДЛФ=Д");
				
		ИначеЕсли Выборка.ЭтоИзвещениеОВыплате Тогда
			ОбластьСтрокаОтчет.Параметры.НаименованиеДокументаОснования = "Извещение о выплате и перечислении денежных средств";
		КонецЕсли;
		
		Если ПоказыватьДокументОснование Тогда
			ОбластьСтрокаОснование.Параметры.Операция = Выборка.Операция;
			
			Таблица.Вывести(ОбластьСтрокаОснование);
			Таблица.Присоединить(ОбластьСтрокаОтчет);
		Иначе
			Таблица.Вывести(ОбластьСтрокаОтчет);
		КонецЕсли;
	КонецЦикла;
	
	// ПОДВАЛ ОТЧЕТА
	Если ПоказыватьДокументОснование Тогда
		Таблица.Вывести(ОбластьПодвалОснование);
		Таблица.Присоединить(ОбластьПодвалОтчет);
	Иначе
		Таблица.Вывести(ОбластьПодвалОтчет);
	КонецЕсли;
КонецПроцедуры

Функция УстановленОтборПо(ИмяПараметра, ПараметрыЗапроса)
	Возврат ЗначениеЗаполнено(ПараметрыЗапроса[ИмяПараметра]) И ПараметрыЗапроса[ИмяПараметра+"Использование"] = Истина; 
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
